/*file
********************************************************************************
<PRE>
模块名       : 
文件名       : 
相关文件     : 
文件实现功能 : fifo 的使用
作者         :  xxxxx

--------------------------------------------------------------------------------
备注         : 

--------------------------------------------------------------------------------
修改记录 : 
日 期:      2008.2.2
版本 :		v1.0
修改人:
修改内容 :

</PRE>
********************************************************************************

* 版权所有(c) , <>, 保留所有权利
*******************************************************************************/

#include "fx3_fifo.h"

/*function
********************************************************************************
<PRE>
函数名   : 
功能     :初始化fifo
参数     : param 区分fifo的结构传入参数指针
		pfifoBuffer，fifo使用的实际的缓冲区，一般为4的倍数以字节计数
		nLen，fifo总共的的字节数
		nDatalen,fifo元素的字节目,只能为1/2/4
返回值   :  成功与否
抛出异常 : 
--------------------------------------------------------------------------------
备注     : 
典型用法 : 
--------------------------------------------------------------------------------
作者     : 
</PRE>
*******************************************************************************/
CyBool_t FifoInitial(tagFifoParam *param, void *pFifoBuffer, uint32_t nLen, uint32_t nDataLen)
{

    if (nLen <= 0 || nLen > FIFO_DEEPTH_MAX_VALUE || pFifoBuffer == 0)
    {
        return CyFalse;
    }
    param->pFifoBuffer = pFifoBuffer;
    param->pFifoStart = param->pFifoBuffer;
    param->pFifoEnd = param->pFifoBuffer;
    param->nFifoLen = nLen;
    param->nDataLen = nDataLen;
    param->nFifoDataNum = 0;
    param->isLock = CyFalse;
    return CyTrue;
}
/*function
********************************************************************************
<PRE>
函数名   : 
功能     :清空fifo
参数     : param 区分fifo的结构传入参数指针
返回值   :  成功与否
抛出异常 : 
--------------------------------------------------------------------------------
备注     : 
典型用法 : 
--------------------------------------------------------------------------------
作者     : 
</PRE>
*******************************************************************************/
void FifoFlush(tagFifoParam *param)
{
    param->pFifoStart = param->pFifoBuffer;
    param->pFifoEnd = param->pFifoBuffer;
    param->nFifoDataNum = 0;
}

/*function
********************************************************************************
<PRE>
函数名   : 
功能     :向fifo中写入一个数据
参数     : param 区分fifo的结构传入参数指针
		d , 写入的数据，有效位数需要和param中的元素字节数匹配
返回值   :  
抛出异常 : 
--------------------------------------------------------------------------------
备注     : 
典型用法 : 
--------------------------------------------------------------------------------
作者     : 
</PRE>
*******************************************************************************/
void FifoPush(tagFifoParam *param, FIFO_DATA d)
{
    if (param->isLock)
    {
        return;
    }

    if (param->nFifoDataNum < param->nFifoLen)
    {
        param->nFifoDataNum += param->nDataLen;
    }
    else
    {
        return;
        /*if (param->pFifoEnd>=((param->pFifoBuffer)+(param->nFifoLen-1))) 
		{
			param->pFifoEnd=param->pFifoBuffer;
		}
		else
			param->pFifoEnd++;
		*/
    }

    CyU3PMemCopy(param->pFifoStart, &d, param->nDataLen);
    if (param->pFifoStart >= ((param->pFifoBuffer) + (param->nFifoLen - param->nDataLen)))
    {
        param->pFifoStart = param->pFifoBuffer;
    }
    else
        param->pFifoStart += param->nDataLen;
}

/*function
********************************************************************************
<PRE>
函数名   : 
功能     :从fifo中读出一个数据
参数     : param 区分fifo的结构传入参数指针
	
返回值   :  读出的数据，有效位数需要和param中的元素字节数匹配
抛出异常 : 
--------------------------------------------------------------------------------
备注     : 
典型用法 : 
--------------------------------------------------------------------------------
作者     : 
</PRE>
*******************************************************************************/
FIFO_DATA FifoPop(tagFifoParam *param)
{
    FIFO_DATA re;
    if (param->isLock)
    {
        return 0;
    }
    CyU3PMemCopy(&re, param->pFifoEnd, param->nDataLen);

    if (param->nFifoDataNum >= param->nDataLen)
    {
        param->nFifoDataNum -= param->nDataLen;
    }
    else
    {
        return 0;
    }

    if (param->pFifoEnd >= (param->pFifoBuffer + (param->nFifoLen - param->nDataLen)))
    {
        param->pFifoEnd = param->pFifoBuffer;
    }
    else
        param->pFifoEnd += param->nDataLen;
    return re;
}

/*function
********************************************************************************
<PRE>
函数名   : 
功能     :得到目前fifo内字节数
参数     : param 区分fifo的结构传入参数指针
	
返回值   :  结果
抛出异常 : 
--------------------------------------------------------------------------------
备注     : 
典型用法 : 
--------------------------------------------------------------------------------
作者     : 
</PRE>
*******************************************************************************/
uint32_t FifoGetDataNumber(tagFifoParam *param)
{
    return param->nFifoDataNum;
}

/*function
********************************************************************************
<PRE>
函数名   : 
功能     :得到目前fifo的深度，以元素计数
参数     : param 区分fifo的结构传入参数指针
	
返回值   :  结果
抛出异常 : 
--------------------------------------------------------------------------------
备注     : 
典型用法 : 
--------------------------------------------------------------------------------
作者     : 
</PRE>
*******************************************************************************/
uint32_t FifoGetFifoDeepth(tagFifoParam *param)
{
    return param->nFifoLen;
}

/*function
********************************************************************************
<PRE>
函数名   : 
功能     :是否锁定fifo
参数     : param 区分fifo的结构传入参数指针
		en   1-锁定fifo，0-解锁fifo
返回值   :   
抛出异常 : 
--------------------------------------------------------------------------------
备注     : 
典型用法 : 
--------------------------------------------------------------------------------
作者     : 
</PRE>
*******************************************************************************/
void FifoLock(tagFifoParam *param, CyBool_t en)
{
    param->isLock = en;
}


/*function
********************************************************************************
<PRE>
函数名   : 
功能     :向fifo中写入一个数据
参数     : param 区分fifo的结构传入参数指针
		d , 写入的数据，有效位数需要和param中的元素字节数匹配
返回值   :  
抛出异常 : 
--------------------------------------------------------------------------------
备注     : 
典型用法 : 
--------------------------------------------------------------------------------
作者     : 
</PRE>
*******************************************************************************/
void FifoPushNLen(tagFifoParam *param, FIFO_DATA *d, uint32_t Len)
{
    for (uint32_t i = 0; i < Len; i++)
    {
        FifoPush(param, d[i]);
    }
}
